Public Member Functions | List of all members
ACAPI::Impl::v1::AbstractFactory Class Reference
API Infrastructure
AbstractFactory is responsible for creating the implementation. You can make your own factory to use it in unit tests. More...
#include <AbstractFactory.hpp>
 Public Member Functions
virtual std::shared_ptr< LicenseInfo::Impl::ProductVersionInfoImplBase >  | CreateLicenseInfoProductVersionInfoImpl (const API_Token &) const
Creates an object of the ProductVersionInfoImplBase that's used by the ProductVersionInfo.
Detailed Description
AbstractFactory is responsible for creating the implementation. You can make your own factory to use it in unit tests.
Since
Archicad 28